; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	spectrograph1 - mode
	infrared6 - mode
	infrared5 - mode
	spectrograph7 - mode
	thermograph3 - mode
	infrared2 - mode
	image4 - mode
	spectrograph0 - mode
	Star0 - direction
	GroundStation1 - direction
	Star2 - direction
	Star3 - direction
	Star4 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Star11 - direction
	Planet12 - direction
	Star13 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 spectrograph0)
	(supports instrument0 thermograph3)
	(supports instrument0 infrared6)
	(calibration_target instrument0 GroundStation6)
	(supports instrument1 infrared5)
	(supports instrument1 spectrograph7)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 GroundStation6)
	(supports instrument2 infrared5)
	(supports instrument2 image4)
	(supports instrument2 infrared2)
	(calibration_target instrument2 GroundStation6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
)
(:goal (and
	(have_image Star7 spectrograph7)
	(have_image Star7 infrared6)
	(have_image Phenomenon8 spectrograph1)
	(have_image Phenomenon8 image4)
	(have_image Phenomenon9 infrared6)
	(have_image Star10 infrared6)
	(have_image Star10 spectrograph1)
	(have_image Star11 spectrograph0)
	(have_image Star11 spectrograph1)
	(have_image Planet12 spectrograph7)
	(have_image Planet12 spectrograph0)
	(have_image Star13 spectrograph0)
))

)

; plan
1. (turn_to satellite0 groundstation5 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 groundstation5)
   goals met: 0 of 12
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 12
3. (calibrate satellite0 instrument1 groundstation5)
   added: (calibrated instrument1)
   goals met: 0 of 12
4. (turn_to satellite0 star7 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 star7)
   goals met: 0 of 12
5. (take_image satellite0 star7 instrument1 spectrograph7)
   added: (have_image star7 spectrograph7)
   goals met: 1 of 12
6. (turn_to satellite0 planet12 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 planet12)
   goals met: 1 of 12
7. (take_image satellite0 planet12 instrument1 spectrograph7)
   added: (have_image planet12 spectrograph7)
   goals met: 2 of 12
8. (turn_to satellite0 groundstation6 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 groundstation6)
   goals met: 2 of 12
9. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 2 of 12
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 12
11. (calibrate satellite0 instrument0 groundstation6)
   added: (calibrated instrument0)
   goals met: 2 of 12
12. (turn_to satellite0 phenomenon8 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 phenomenon8)
   goals met: 2 of 12
13. (take_image satellite0 phenomenon8 instrument0 spectrograph1)
   added: (have_image phenomenon8 spectrograph1)
   goals met: 3 of 12
14. (turn_to satellite0 phenomenon9 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon9)
   goals met: 3 of 12
15. (take_image satellite0 phenomenon9 instrument0 infrared6)
   added: (have_image phenomenon9 infrared6)
   goals met: 4 of 12
16. (turn_to satellite0 planet12 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet12)
   goals met: 4 of 12
17. (take_image satellite0 planet12 instrument0 spectrograph0)
   added: (have_image planet12 spectrograph0)
   goals met: 5 of 12
18. (turn_to satellite0 star10 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 star10)
   goals met: 5 of 12
19. (take_image satellite0 star10 instrument0 infrared6)
   added: (have_image star10 infrared6)
   goals met: 6 of 12
20. (take_image satellite0 star10 instrument0 spectrograph1)
   added: (have_image star10 spectrograph1)
   goals met: 7 of 12
21. (turn_to satellite0 star11 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star11)
   goals met: 7 of 12
22. (take_image satellite0 star11 instrument0 spectrograph0)
   added: (have_image star11 spectrograph0)
   goals met: 8 of 12
23. (take_image satellite0 star11 instrument0 spectrograph1)
   added: (have_image star11 spectrograph1)
   goals met: 9 of 12
24. (turn_to satellite0 star13 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star13)
   goals met: 9 of 12
25. (take_image satellite0 star13 instrument0 spectrograph0)
   added: (have_image star13 spectrograph0)
   goals met: 10 of 12
26. (turn_to satellite0 star7 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star7)
   goals met: 10 of 12
27. (take_image satellite0 star7 instrument0 infrared6)
   added: (have_image star7 infrared6)
   goals met: 11 of 12
28. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 11 of 12
29. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 11 of 12
30. (turn_to satellite0 groundstation6 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 groundstation6)
   goals met: 11 of 12
31. (calibrate satellite0 instrument2 groundstation6)
   added: (calibrated instrument2)
   goals met: 11 of 12
32. (turn_to satellite0 phenomenon8 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 phenomenon8)
   goals met: 11 of 12
33. (take_image satellite0 phenomenon8 instrument2 image4)
   added: (have_image phenomenon8 image4)
   goals met: 12 of 12
